In [1]:
import numpy as np
import pandas as pd

In [2]:
df_main = pd.read_csv('main.csv')
df_net_property = pd.read_csv('net_property.csv')
df_seats_property = pd.read_csv('seats_property.csv')
df_type_property = pd.read_csv('type_property.csv')

In [3]:
t = df_seats_property.sort_values(by=['ID', 'ver_ID'], ascending=[True, False]).drop_duplicates('ID', keep='first')
t['SeatsCount_group'] = pd.cut(t.SeatsCount, bins=[0, 5, 15, 25, np.inf], include_lowest=True, labels=list('1234'))
t

           ID  SeatsCount  ver_ID SeatsCount_group
673      5882          75       2                4
3965    19627          20       2                3
10104   19657          85       2                4
5032    19678          46       1                4
1449    19681          24       1                3
...       ...         ...     ...              ...
2212   375905          34       1                4
8218   375933           5       2                1
8637   375940          10       2                2
2158   375942           0       1                1
6693   375956           0       1                1

[8432 rows x 4 columns]

In [4]:
t2 = df_net_property.query('IsNetObject =="да"')
t2.shape

(2355, 2)

In [5]:
t3 = df_type_property[(df_type_property.is_actual==True) & (df_type_property.TypeObject == 'кафе')]
t3.shape

(2401, 3)

In [6]:
df_main.merge(t3, how='left').merge(t2, how='left').merge(t, how='left').dropna().groupby('SeatsCount_group')['ID'].count()

SeatsCount_group
1     2
2    12
3    10
4    46
Name: ID, dtype: int64

In [45]:
t4 = t2.merge(t3, on='ID', how='left')
df1 = t4.merge(t, on='ID', how='left')
df1

,ID,IsNetObject,TypeObject,is_actual,SeatsCount,ver_ID,SeatsCount_group
0,25950,да,NaN,NaN,94.0,1.0,4
1,357629,да,NaN,NaN,8.0,2.0,2
2,256733,да,NaN,NaN,NaN,NaN,NaN
3,26149,да,NaN,NaN,NaN,NaN,NaN
4,77502,да,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...
2350,314845,да,NaN,NaN,NaN,NaN,NaN
2351,154865,да,NaN,NaN,13.0,1.0,2
2352,354381,да,NaN,NaN,0.0,1.0,1
2353,178958,да,NaN,NaN,NaN,NaN,NaN
2354,366823,да,NaN,NaN,15.0,1.0,2

In [48]:
df1.dropna(subset=['TypeObject', 'is_actual', 'SeatsCount_group'])

,ID,IsNetObject,TypeObject,is_actual,SeatsCount,ver_ID,SeatsCount_group
21,340372,да,кафе,True,48.0,1.0,4
43,344252,да,кафе,True,188.0,1.0,4
48,261905,да,кафе,True,13.0,2.0,2
56,215843,да,кафе,True,33.0,2.0,4
103,284911,да,кафе,True,25.0,1.0,3
...,...,...,...,...,...,...,...
2293,27128,да,кафе,True,255.0,2.0,4
2315,299073,да,кафе,True,9.0,2.0,2
2328,298813,да,кафе,True,30.0,2.0,4
2341,277806,да,кафе,True,20.0,2.0,3
2343,279733,да,кафе,True,15.0,2.0,2

In [51]:
t4 = t4.dropna()

In [60]:
df1

,ID,IsNetObject,TypeObject,is_actual,SeatsCount,ver_ID,SeatsCount_group
0,25950,да,NaN,NaN,94.0,1.0,4
1,357629,да,NaN,NaN,8.0,2.0,2
2,256733,да,NaN,NaN,NaN,NaN,NaN
3,26149,да,NaN,NaN,NaN,NaN,NaN
4,77502,да,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...
2350,314845,да,NaN,NaN,NaN,NaN,NaN
2351,154865,да,NaN,NaN,13.0,1.0,2
2352,354381,да,NaN,NaN,0.0,1.0,1
2353,178958,да,NaN,NaN,NaN,NaN,NaN
2354,366823,да,NaN,NaN,15.0,1.0,2

In [12]:
t = t.merge(df_type_property, on='ID', how='left').merge(df_net_property, on='ID', how='left')
t

,ID,SeatsCount,ver_ID,TypeObject,is_actual,IsNetObject
0,5882,75,2,кафе,True,нет
1,19627,20,2,NaN,NaN,нет
2,19657,85,2,кафе,True,нет
3,19678,46,1,предприятие быстрого обслуживания,True,да
4,19681,24,1,предприятие быстрого обслуживания,False,нет
...,...,...,...,...,...,...
8428,375905,34,1,кафе,True,нет
8429,375933,5,2,закусочная,True,нет
8430,375940,10,2,NaN,NaN,нет
8431,375942,0,1,предприятие быстрого обслуживания,True,нет
8432,375956,0,1,кафе,False,да

In [17]:
t['SeatsCount_group'] = pd.cut(t.SeatsCount, bins=[0, 5, 15, 25, np.inf], include_lowest=True, labels=list('1234'))
t

,ID,SeatsCount,ver_ID,TypeObject,is_actual,IsNetObject,SeatsCount_group
0,5882,75,2,кафе,True,нет,4
1,19627,20,2,NaN,NaN,нет,3
2,19657,85,2,кафе,True,нет,4
3,19678,46,1,предприятие быстрого обслуживания,True,да,4
4,19681,24,1,предприятие быстрого обслуживания,False,нет,3
...,...,...,...,...,...,...,...
8428,375905,34,1,кафе,True,нет,4
8429,375933,5,2,закусочная,True,нет,1
8430,375940,10,2,NaN,NaN,нет,2
8431,375942,0,1,предприятие быстрого обслуживания,True,нет,1
8432,375956,0,1,кафе,False,да,1

In [29]:
t[(t.IsNetObject == 'да') & (t.is_actual==True) & (t.TypeObject == 'кафе')]

,ID,SeatsCount,ver_ID,TypeObject,is_actual,IsNetObject,SeatsCount_group
50,20182,35,1,кафе,True,да,4
246,22005,163,2,кафе,True,да,4
257,22089,86,1,кафе,True,да,4
274,22375,90,1,кафе,True,да,4
276,22383,128,1,кафе,True,да,4
...,...,...,...,...,...,...,...
7782,363535,22,2,кафе,True,да,3
8115,370025,140,2,кафе,True,да,4
8192,371701,7,1,кафе,True,да,2
8368,374676,9,2,кафе,True,да,2
8397,375409,55,2,кафе,True,да,4

In [83]:
t = df_seats_property.sort_values(by=['ID', 'ver_ID'], ascending=[True, False]).drop_duplicates('ID', keep='first')
t['SeatsCount_group'] = pd.cut(t.SeatsCount, bins=[0, 5, 15, 25, np.inf], include_lowest=True, labels=list('1234'))
t

           ID  SeatsCount  ver_ID SeatsCount_group
673      5882          75       2                4
3965    19627          20       2                3
10104   19657          85       2                4
5032    19678          46       1                4
1449    19681          24       1                3
...       ...         ...     ...              ...
2212   375905          34       1                4
8218   375933           5       2                1
8637   375940          10       2                2
2158   375942           0       1                1
6693   375956           0       1                1

[8432 rows x 4 columns]

In [79]:
t4 = t2.merge(t3, on='ID', how='left')

In [84]:
t4.merge(t, on='ID', how='left').dropna(axis=0)

,ID,IsNetObject,TypeObject,is_actual,SeatsCount,ver_ID,SeatsCount_group
21,340372,да,кафе,True,48.0,1.0,4
43,344252,да,кафе,True,188.0,1.0,4
48,261905,да,кафе,True,13.0,2.0,2
56,215843,да,кафе,True,33.0,2.0,4
103,284911,да,кафе,True,25.0,1.0,3
...,...,...,...,...,...,...,...
2293,27128,да,кафе,True,255.0,2.0,4
2315,299073,да,кафе,True,9.0,2.0,2
2328,298813,да,кафе,True,30.0,2.0,4
2341,277806,да,кафе,True,20.0,2.0,3
2343,279733,да,кафе,True,15.0,2.0,2